Revit 2024 API
FBXExportOptions.WithoutBoundaryEdges Property
True to export without boundary edges, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool WithoutBoundaryEdges { get; set; }
Visual Basic
Public Property WithoutBoundaryEdges As Boolean
	Get
	Set
Visual C++
public:
property bool WithoutBoundaryEdges {
	bool get ();
	void set (bool value);
}
Field Value
The default value is false.
See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace